IdentityDirectoryEvents
| where ActionType == @"Account Password Never Expires changed"
| extend NewValue = parse_json(AdditionalFields)["NewValue"]
| extend OldValue = parse_json(AdditionalFields)["OldValue"]
| project Timestamp, AccountName, AccountDisplayName, AccountDomain, NewValue, OldValue


IdentityDirectoryEvents
| where ActionType == @"Account Password Not Required changed"
| extend NewValue = parse_json(AdditionalFields)["NewValue"]
| extend OldValue = parse_json(AdditionalFields)["OldValue"]
| project Timestamp, AccountName, AccountDisplayName, AccountDomain, NewValue, OldValue