let lookBack = 30d;
SecurityIncident
| where TimeGenerated > ago(lookBack)
| summarize arg_max(TimeGenerated,*) by IncidentNumber
| mv-expand AlertIds
| extend AlertId = tostring(AlertIds)
| join  (SecurityAlert)
on $left. AlertId == $right. SystemAlertId
| mv-expand parse_json(Entities)
| extend EType = tostring((Entities.Type))
| where EType == "host"
| extend HostName_ = tostring(Entities.HostName)
| summarize Hosts = make_set(HostName_) by Title, ProviderName