CloudAppEvents
// | project IPAddress, ISP
 | distinct IPAddress, ISP, City
| where ISP contains "scaler"
 | extend inrange = ipv4_is_in_range(IPAddress, '165.225.94.0/24') 



let zscalernetworks=dynamic([
      "165.225.94.0/24"
]);
CloudAppEvents
// | project IPAddress, ISP
 | distinct IPAddress, ISP, City
| where ISP contains "scaler"
//  | extend inrange = ipv4_is_in_range(IPAddress, '165.225.94.0/24') 
| extend inrange=ipv4_is_in_any_range(IPAddress, zscalernetworks)




let MySubnets = toscalar ( _GetWatchlist('NetworkAddresses')
| summarize make_set((SearchKey)));
SigninLogs
| extend ismatch = ipv4_is_in_any_range(IPAddress,MySubnets)
| extend city_ = tostring(LocationDetails.city)
| extend state_ = tostring(LocationDetails.state)
| project TimeGenerated,CorrelationId, UserPrincipalName, IPAddress, Location, ismatch, AppDisplayName, ClientAppUsed, city_, state_

let IP_Data =
         externaldata(network:string,geoname_id:long,continent_code:string,continent_name:string,
         country_iso_code:string,country_name:string,is_anonymous_proxy:bool,
         is_satellite_provider:bool)
         ['https://raw.githubusercontent.com/datasets/geoip2-ipv4/master/data/geoip2-ipv4.csv'];
let MySubnets = toscalar ( _GetWatchlist('NetworkAddresses')
| summarize make_set((SearchKey)));
SigninLogs
| extend city_ = tostring(LocationDetails.city)
| extend state_ = tostring(LocationDetails.state)
| evaluate ipv4_lookup(IP_Data, IPAddress,network, return_unmatched = true)
| mv-apply ip_range = MySubnets to typeof(string) on (
    extend isinrange = ipv4_is_in_range(IPAddress, ip_range)
    //summarize countif(ipv4_is_in_range(IPAddress, ip_range))
    // | where countif_ == 0
)
| project TimeGenerated, CorrelationId, UserPrincipalName, IPAddress, Location, ip_range, isinrange, city_, state_,continent_name,country_name, country_iso_code




let maxSpeed = 1000;
SigninLogs
| where ResultType == "0"
| extend latitude_ = todouble(parse_json(tostring(LocationDetails.geoCoordinates)).latitude)
| extend longitude_ = todouble(parse_json(tostring(LocationDetails.geoCoordinates)).longitude)
| extend countryOrRegion = tostring(LocationDetails.countryOrRegion)
| extend state = tostring(LocationDetails.state)
| extend location = strcat(state,' - ', countryOrRegion)
| where location <> ' - '
| extend browser = tostring(DeviceDetail.browser)
| summarize Count=count(),IP=any(IPAddress),Last=max(TimeGenerated) by UserDisplayName, latitude_, longitude_, Locations=tostring(location), browser,AppDisplayName, UserPrincipalName, Location
| extend coordinates = pack_array(latitude_,longitude_)
| summarize coordinates=any(coordinates),StateCountries=makeset(Locations),Last=max(Last),IP=any(IP),Apps=makeset(AppDisplayName),Browsers=makeset(browser), Locations=makeset(Locations) by UserDisplayName, UserPrincipalName, Location
| summarize Coordinates=makeset(coordinates),NumberOfCountries=dcount(Location) ,StateCountries=makeset(Locations),Timestamps=makeset(Last),IPs=makeset(IP),Apps=makeset(Apps),Browsers=makeset(Browsers) by UserDisplayName, UserPrincipalName
| where NumberOfCountries > 1
| extend distance = round(geo_distance_2points(todouble(Coordinates[1]),todouble(Coordinates[0]),todouble(Coordinates[3]),todouble(Coordinates[2]))/1000,0)
| extend hours = abs(datetime_diff('hour', todatetime(Timestamps[1]),todatetime(Timestamps[0])))
| where hours > 0
| extend speedKmPerHour = round(distance/hours,0)
| where speedKmPerHour > maxSpeed
| project-reorder Timestamps, UserDisplayName, UserPrincipalName, IPs, speedKmPerHour, distance, hours, StateCountries, Apps, Browsers, StateCountries
| sort by UserPrincipalName asc
| extend IPs = replace('[\\[|\\|\\\\|"\\]]','',tostring(IPs))


