// old way to get additional geo info, but in Sign-in logs there is no added value because the location info is already in the logs by default
let geoData = externaldata(network:string,geoname_id:string,continent_code:string,continent_name:string,country_iso_code:string,country_name:string,is_anonymous_proxy:string,is_satellite_provider:string) [@"https://raw.githubusercontent.com/datasets/geoip2-ipv4/master/data/geoip2-ipv4.csv"] with (ignoreFirstRecord=true, format="csv");
SigninLogs
| where isnotempty( IPAddress)
| where TimeGenerated > ago(90d)
| project TimeGenerated, IPAddress, Location, LocationDetails
| evaluate ipv4_lookup (geoData, IPAddress, network, true)


// old way to get additional geo info, here there's added value to do so since the location info is NOT included in the logs
let geoData = externaldata(network:string,geoname_id:string,continent_code:string,continent_name:string,country_iso_code:string,country_name:string,is_anonymous_proxy:string,is_satellite_provider:string) [@"https://raw.githubusercontent.com/datasets/geoip2-ipv4/master/data/geoip2-ipv4.csv"] with (ignoreFirstRecord=true, format="csv");
OfficeActivity
| where isnotempty( ClientIP)
| where TimeGenerated > ago(90d)
| project TimeGenerated, ClientIP, Operation, OfficeWorkload
| evaluate ipv4_lookup (geoData, ClientIP, network, true)

//  // the new way
OfficeActivity
| where isnotempty( ClientIP)
| where TimeGenerated > ago(90d)
| project TimeGenerated, ClientIP, Operation, OfficeWorkload
| extend geoinfo =  geo_info_from_ip_address(ClientIP)
| extend country = tostring(geoinfo.country)
| extend city = tostring(geoinfo.city)
| extend state = tostring(geoinfo.state)
| extend latitude = tostring(geoinfo.latitude)
| extend longitude = tostring(geoinfo.longitude)
// | where ClientIP contains "::ffff:52.112.120.202"

