let ioc_lookBack = 90d;
let lookback = 90d;
let IncTitle = dynamic(["A potentially malicious URL click was detected"]);
let MaliciousUrls = (
SecurityIncident
| where TimeGenerated > ago(lookback)
| where Title has_any (IncTitle)
| summarize arg_max(TimeGenerated,*) by IncidentNumber
| mv-expand AlertIds
| extend AlertId = tostring(AlertIds)
| join  (SecurityAlert)
on $left. AlertId == $right. SystemAlertId
| mv-expand parse_json(Entities)
| extend EType = tostring((Entities.Type))
| where EType == 'url'
| extend MaliciousUrl = tostring(Entities.Url)
| project MaliciousUrl
| distinct MaliciousUrl);
MaliciousUrls


let IP_Indicators = (
(ThreatIntelligenceIndicator
| where TimeGenerated >= ago(90d) and ExpirationDateTime > now()
| summarize LatestIndicatorTime = arg_max(TimeGenerated, *) by IndicatorId
| where Active == true
| where isnotempty(NetworkIP) or isnotempty(EmailSourceIpAddress) or isnotempty(NetworkDestinationIP) or isnotempty(NetworkSourceIP)
| extend TI_ipEntity = iff(isnotempty(NetworkIP), NetworkIP, NetworkDestinationIP)
| extend TI_ipEntity = iff(isempty(TI_ipEntity) and isnotempty(NetworkSourceIP), NetworkSourceIP, TI_ipEntity)
| extend TI_ipEntity = iff(isempty(TI_ipEntity) and isnotempty(EmailSourceIpAddress), EmailSourceIpAddress, TI_ipEntity)
| where ipv4_is_private(TI_ipEntity) == false and  TI_ipEntity !startswith "fe80" and TI_ipEntity !startswith "::" and TI_ipEntity !startswith "127.")
| distinct TI_ipEntity, Description, ThreatType, SourceSystem
);
DeviceNetworkEvents
| where TimeGenerated > ago (30d)
//| where ActionType == 'HttpConnectionInspected' // and AdditionalFields contains "POST"
| extend Info = parse_json(AdditionalFields)
| extend Host = tostring(AdditionalFields.host)
| extend direction = tostring(AdditionalFields.direction)
| extend origin = tostring(AdditionalFields.origin)
| extend referer = tostring(AdditionalFields.referer)
| extend uri = tostring(AdditionalFields.uri)
| extend status_code = tostring(AdditionalFields.status_code)
| extend status_msg = tostring(AdditionalFields.status_msg)
| project TimeGenerated, ActionType, DeviceName, RemoteIP, RemoteUrl , Host, origin, referer, uri, status_code, status_msg, direction, Info, AdditionalFields
| join IP_Indicators on $left. RemoteIP == $right. TI_ipEntity