let IncTitle = dynamic([
"Connection to a custom network indicator on one endpoint","Unsanctioned cloud app access was blocked on one endpoint"
]);
SecurityIncident
| where TimeGenerated > ago(90d)
| where Title has_any (IncTitle)
| summarize arg_max(TimeGenerated,*) by IncidentNumber
| mv-expand AlertIds
| extend AlertId = tostring(AlertIds)
| join  (SecurityAlert)
on $left. AlertId == $right. SystemAlertId
| mv-expand parse_json(Entities)
| extend EType = tostring((Entities.Type))
//| where EType == "account"
| where EType == "url"
| extend Url_ = tostring(Entities.Url)
//| summarize count() by Url_, Title
//| where Url_ contains "dropbox"
//| distinct Url_, Title
| where Title == "Connection to a custom network indicator on one endpoint"
| where Url_ == "www.helltec.droppy.ch"
| summarize count() by bin(TimeGenerated,1d)
| render timechart 