let ioc_lookBack = 90d;
let IncTitle = "Authentication Method Changed for Privileged Account";
SecurityIncident
| where TimeGenerated > ago(90d)
| where Title == IncTitle
| summarize arg_max(TimeGenerated,*) by IncidentNumber
| mv-expand AlertIds
| extend AlertId = tostring(AlertIds)
| join  (SecurityAlert)
on $left. AlertId == $right. SystemAlertId
| mv-expand parse_json(Entities)
| extend EType = tostring((Entities.Type))
| extend UPN = iff(isnotempty(Entities.DisplayName),Entities.DisplayName,"")
| extend IPAddress = iff(isnotempty(Entities.Address),Entities.Address,"")
| summarize IP = make_set(IPAddress), UPN = make_set(UPN) by IncidentNumber